Repository: MunMihai/Fatigue-Detection-App
Catalog: lib/core/config/l10n/intl_*.arb
Languages: ro, ru

# homeTitle
source: Home
ro: Acasă
ru: Главная

source: Set Up your system
ro: Setează sistemul
ru: Настройте систему

source: Advanced Settings
ro: Setări avansate
ru: Расш. настройки

source: START MONITORING
ro: ÎNCEPE SESIUNEA
ru: НАЧАТЬ МОНИТОРИНГ

source: Session already active!
ro: Sesiune deja activă!
ru: Сессия уже активна!

source: Reports
ro: Rapoarte
ru: Отчёты

source: Save Reports For
ro: Durata salvării
ru: Сохранять отчёты

source: Sessions History
ro: Istoricul sesiunilor
ru: История сессий

source: Fatigue Level
ro: Nivel de oboseală
ru: Уровень усталости

source: Recommendations
ro: Recomandări
ru: Рекомендации

source: Break Time
ro: Timp de pauză
ru: Время перерыва

source: Breaks
ro: Pauze
ru: Перерывы

source: Total Session Time
ro: Timp total sesiune
ru: Общее время сессии

source: RESUME Monitoring
ro: REIA MONITORIZAREA
ru: Возобновить

source: PAUSE Monitoring
ro: PUNE PE PAUZĂ
ru: Пауза

source: Zoom
ru: Масштаб

source: Exposure
ro: Expunere
ru: Экспозиция

source: Processing...
ro: Se procesează...
ru: Обработка...

source: All Sessions
ro: Toate sesiunile
ru: Все сессии

source: Sort by:
ro: Sortează după:
ru: Сортировать по

# dateDesc
source: Date ↓
ro: Dată ↓
ru: Дате ↓

# dateAsc
source: Date ↑
ro: Dată ↑
ru: Дате ↑

# durationDesc
source: Duration ↓
ro: Durată ↓
ru: Длит. ↓

# durationAsc
source: Duration ↑
ro: Durată ↑
ru: Длит. ↑

# filterHint
source: Filter by date or fatigue level...
ro: Filtrează după dată sau nivel de oboseală...
ru: Фильтровать по дате или уровню усталости...

source: No sessions found.
ro: Nicio sesiune găsită.
ru: Сессии не найдены.

source: Started at
ro: Început la
ru: Начато в

source: Duration for
ro: Durată de
ru: Длительность

source: Retention for
ro: Păstrat pentru
ru: Сохраняется в течение

source: months
ro: luni
ru: месяцев

source: Alerts
ro: Alerte
ru: Оповещения

source: View All
ro: Vezi tot
ru: Смотреть всё

source: Sessions
ro: Sesiuni
ru: Сессии

source: No reports found.
ro: Nu au fost găsite rapoarte.
ru: Отчёты не найдены.

# settingsTitle
source: System Settings
ro: Setările sistemului
ru: Настройки системы

source: Fatigue Counter
ro: Contor sesiune
ru: Пауза по времени

source: Enable Counter
ro: Activează alarma
ru: Таймер оповещения

source: Toggle on/off
ro: Alertă după expirarea timerului
ru: Оповещение после истечения таймера

# toggleShowHide
source: Toggle to show/hide
ro: Afișează/ascunde
ru: Показать/Скрыть

source: Preferences
ro: Preferințe
ru: Настройки

source: Show Reports Section
ro: Rapoarte istorice
ru: Исторические отчёты

# reportsSectionDisabled
source: Reports section is disabled!
ro: Secțiunea de rapoarte este dezactivată!
ru: Раздел отчётов отключён!

source: Start your journey
ro: Începe-ți călătoria
ru: В путь!

# journeyDescription
source: To help you stay safe on the road, we’ll monitor for signs of fatigue and offer a reminder to take a break if needed.
ro: Pentru a te ajuta să fii în siguranță pe drum, vom monitoriza semnele de oboseală și îți vom reaminti să iei pauze la nevoie.
ru: Чтобы обеспечить вашу безопасность, мы будем отслеживать признаки усталости и напоминать о перерывах при необходимости.

source: Start navigation
ro: Să începem
ru: Начать

source: Check FAQs
ro: Ajutor
ru: Помощь

# cameraPermissionRequired
source: Camera permission is required to proceed.
ro: Permisiunea pentru cameră este necesară pentru a continua.
ru: Для продолжения необходимо разрешение на использование камеры.

# enableCameraInSettings
source: Please enable camera permission in settings.
ro: Activează permisiunea pentru cameră din setări.
ru: Включите разрешение на камеру в настройках.

# couldNotOpenSettings
source: Could not open app settings.
ro: Nu s-au putut deschide setările aplicației.
ru: Не удалось открыть настройки приложения.

# faqTitle
source: FAQ - Driver Monitoring
ro: Întrebări frecvente - Monitorizarea șoferului
ru: Часто задаваемые вопросы - Мониторинг водителя

# faq1Q
source: How does the fatigue detection work?
ro: Cum funcționează detecția oboselii?
ru: Как работает обнаружение усталости?

# faq1A
source: The system analyzes facial features in real-time video, focusing on eye closure and yawning detection. If signs of fatigue are detected consistently, the system triggers alerts to notify you.
ro: Sistemul analizează trăsături faciale în timp real, concentrându-se pe închiderea ochilor și detectarea căscatului. Dacă sunt detectate semne constante de oboseală, sistemul declanșează alerte.
ru: Система анализирует лицевые признаки в реальном времени, с акцентом на закрытие глаз и зевоту. При обнаружении признаков усталости система активирует оповещения.

# faq2Q
source: What happens if no face is detected?
ro: Ce se întâmplă dacă nu este detectată nicio față?
ru: Что произойдет, если лицо не обнаружено?

# faq2A
source: If no face is detected for more than one minute, the monitoring session will automatically stop and a report of the session will be saved.
ro: Dacă nu este detectată nicio față timp de peste un minut, sesiunea de monitorizare se va opri automat și va fi salvat un raport al sesiunii.
ru: Если лицо не обнаружено более одной минуты, мониторинг будет автоматически остановлен и сессия сохранена.

# faq3Q
source: How do I calibrate the camera for better detection?
ro: Cum calibrez camera pentru o detecție mai bună?
ru: Как откалибровать камеру для лучшего обнаружения?

# faq3A
source: In Camera Preview, you can adjust the camera zoom and brightness settings so your face is clearly visible. For accurate fatigue detection, make sure there is enough light inside the car. Avoid shadows or extreme backlight.
ro: În secțiunea camerei, poți ajusta zoom-ul și luminozitatea camerei pentru a te asigura că fața ta este vizibilă. Pentru o detecție precisă, asigură-te că există suficientă lumină în mașină. Evită umbrele sau lumina din spate.
ru: В разделе камеры можно настроить масштаб и яркость, чтобы лицо было хорошо видно. Убедитесь, что в салоне достаточно света и нет теней.

# faq4Q
source: How can I adjust the sensitivity?
ro: Cum pot ajusta sensibilitatea?
ru: Как изменить чувствительность?

# faq4A
source: You can adjust the detection sensitivity directly from the Home screen in the "Set Up Your System" section. We recommend avoiding the highest level unless necessary, as it may lead to more frequent alerts.
ro: Poți ajusta sensibilitatea direct din ecranul principal, în secțiunea „Configurează-ți sistemul”. Se recomandă evitarea nivelului maxim pentru a preveni alertele frecvente.
ru: Чувствительность можно изменить на главном экране в разделе «Настройте систему». Не рекомендуется максимальный уровень, чтобы избежать ложных срабатываний.

# faq5Q
source: Can I review past monitoring sessions?
ro: Pot vizualiza sesiunile anterioare?
ru: Можно ли просматривать предыдущие сессии?

# faq5A
source: Yes, all previous sessions are stored locally. Go to Reports to view your session history, detailed fatigue levels, and alerts.
ro: Da, toate sesiunile anterioare sunt salvate local. Accesează Rapoarte pentru a vedea istoricul sesiunilor, nivelurile de oboseală și alertele.
ru: Да, все предыдущие сессии сохраняются локально. Перейдите в раздел «Отчёты», чтобы просмотреть историю сессий, уровень усталости и оповещения.

# faq6Q
source: Why can't I find the Reports section?
ro: De ce nu pot accesa secțiunea Rapoarte?
ru: Почему я не могу открыть раздел отчётов?

# faq6A
source: The Reports section is disabled by default. To enable it, go to Settings > Preferences and activate “Enable Reports Section”. Once enabled, you can review your past monitoring sessions and view detailed reports.
ro: Secțiunea Rapoarte este dezactivată implicit. Pentru a o activa, accesează Setări > Preferințe și activează „Afișează secțiunea rapoarte”.
ru: Раздел отчётов отключён по умолчанию. Чтобы его включить, перейдите в Настройки > Настройки и включите «Показать раздел отчётов».

# faq7Q
source: Does the app work without an internet connection?
ro: Funcționează aplicația fără conexiune la internet?
ru: Работает ли приложение без интернета?

# faq7A
source: Absolutely! All detection and alerts are processed offline on your device. No internet connection is required for monitoring.
ro: Absolut! Toate detecțiile și alertele sunt procesate local pe dispozitiv. Nu este necesară conexiune la internet.
ru: Конечно! Всё обнаружение и оповещения обрабатываются локально на устройстве. Интернет не требуется.

# faq8Q
source: How is my data stored and is it safe?
ro: Cum sunt stocate datele mele și sunt în siguranță?
ru: Как хранятся мои данные и безопасны ли они?

# faq8A
source: Session data is stored locally on your device. No data is shared externally. You can configure data retention settings in the app.
ro: Datele sesiunii sunt stocate local pe dispozitiv. Nicio informație nu este partajată extern. Poți configura perioada de păstrare din aplicație.
ru: Данные сессий сохраняются локально на устройстве. Никакая информация не передаётся наружу. Вы можете настроить период хранения данных в приложении.

# faq9Q
source: What is the break recommendation based on?
ro: Pe ce se bazează recomandările de pauză?
ru: На чём основаны рекомендации по перерыву?

# faq9A
source: Break recommendations are triggered by fatigue scores or session timeouts. Customize break intervals in Settings.
ro: Recomandările de pauză sunt declanșate de scorurile de oboseală sau expirarea sesiunii. Poți personaliza intervalele din Setări.
ru: Рекомендации основаны на уровне усталости или истечении сессии. Вы можете изменить интервал в настройках.

source: Monitoring Status
ro: Stare monitorizare
ru: Статус мониторинга

source: Camera Preview
ro: Vizualizare cadre
ru: Предпросмотр камеры

# warningAlert
source: 🚨 ALERT! 🚨
ro: 🚨 ALERTĂ! 🚨
ru: ПРЕДУПРЕЖДЕНИЕ!

# fatigueDetected
source: Fatigue detected! Please remain as cautious as possible. Plan a stop shortly.
ro: Oboseală detectată! Vă rugăm să rămâneți cât mai prudent. Planificați o oprire în curând.
ru: Обнаружена усталость! Будьте внимательны. Запланируйте остановку.

# viewReports
source: View driving session reports
ro: Vezi rapoartele sesiunilor de condus
ru: Просмотр отчётов о сессиях вождения

source: Detection Sensitivity
ro: Nivel sensibilitate
ru: Чувствительность

source: Current sensitivity
ro: Valoare curentă
ru: Текущее значение

source: Set Alarm Time
ro: Cronometrul
ru: Настроить

# hours
source: h
ru: ч

# minutes
source: min
ro: m
ru: м

# seconds
source: sec
ru: сек

# stopButton
source: STOP
ro: OPREȘTE
ru: СТОП

# cancelButton
source: Cancel
ro: Anulează
ru: Отмена

# continueButton
source: CONTINUE
ro: CONTINUĂ
ru: ПРОДОЛЖИТЬ

# okButton
source: OK
ru: ОК

# deleteButton
source: Delete Session
ro: Șterge sesiunea
ru: Удалить сессию

# confirmationTitle
source: Confirmation
ro: Confirmare
ru: Подтверждение

# confirmationMessage
source: Are you sure you want to delete this session?
ro: Ești sigur că vrei să ștergi această sesiune?
ru: Вы уверены, что хотите удалить эту сессию?

# removed
source: Report successfully deleted!
ro: Raport șters cu succes!
ru: Отчёт успешно удалён!

source: No active session!
ro: Nicio sesiune activă!
ru: Нет активной сессии!

source: Stop Monitoring
ro: Oprește monitorizarea
ru: Остановить

# stopMonitoringMessage
source: Are you sure you want to stop monitoring? Stopping monitoring will interrupt all alerts and stop recording the current session.
ro: Ești sigur că vrei să oprești monitorizarea? Oprirea va întrerupe toate alertele și va opri înregistrarea sesiunii curente.
ru: Вы уверены, что хотите остановить мониторинг? Оповещения прекратятся и текущая сессия будет завершена.

source: Out Of Time
ro: Timp expirat
ru: Время истекло

# outOfTimeMessage
source: The allocated monitoring time has expired! Do you want to stop monitoring session or continue?
ro: Timpul alocat pentru monitorizare a expirat! Dorești să oprești sesiunea sau să continui?
ru: Время мониторинга истекло! Хотите завершить сессию или продолжить?

source: Time Reminder
ro: Atenționare timp
ru: Время!

# timeReminderMessage
source: You have {minutesLeft} minutes remaining before the monitoring session ends!
ro: Mai ai {minutesLeft} minute până la sfârșitul sesiunii de monitorizare!
ru: Осталось {minutesLeft} минут до конца сессии!

source: No active session to stop!
ro: Nicio sesiune activă de oprit!
ru: Нет активной сессии для остановки!

# sessionSavedWithScore
source: Session saved successfully!
ro: Sesiune salvată cu succes!
ru: Сессия успешно сохранена!

# drowsiness
source: Closed eyes!
ro: Ochi închiși!
ru: Закрытые глаза!

# sessionExpired
source: Session time expired!
ro: Alertă de expirare a timpului!
ru: Сессия завершена по таймеру!

# yawning
source: Repeated yawning
ro: Căscat repetat
ru: Повторяющаяся зевота

source: Fatigue Score
ro: Nivel de oboseală
ru: Оценка усталости

source: Fatigue Score Over Time
ro: Evoluția oboselii în timp
ru: Динамика усталости

source: No alerts detected!
ro: Nu sunt alerte!
ru: Предупреждений не обнаружено!

# sessionWentPerfectly
source: This session went perfectly.
ro: Această sesiune a decurs perfect.
ru: Сессия прошла идеально.

# fatigueLevelNormal
source: Normal
ru: Нормальный

# fatigueLevelGood
source: Good
ro: Bun
ru: Хороший

# fatigueLevelModerate
source: Moderate
ro: Moderat
ru: Умеренный

# fatigueLevelHigh
source: High
ro: Ridicat
ru: Высокий

# fatigueLevelExtreme
source: Extreme
ro: Extrem
ru: Крайний

# fatigueRecTitleNormal
source: Stay Focused
ro: Rămâi atent
ru: Оставайтесь внимательным

# fatigueRecTitleGood
source: Maintain Awareness
ro: Menține vigilența
ru: Сохраняйте бдительность

# fatigueRecTitleModerate
source: Be Cautious
ro: Fii precaut
ru: Будьте осторожны

# fatigueRecTitleHigh
source: Take a Break
ro: Fă o pauză
ru: Сделайте перерыв

# fatigueRecTitleExtreme
source: Stop Driving!
ro: Oprește-te din condus!
ru: Прекратите вождение!

# fatigueRecDescNormal
source: Keep your eyes on the road while we keep ours on you. Stay focused and drive safely!
ro: Ține ochii pe drum în timp ce noi îi ținem pe tine. Fii atent și condu în siguranță!
ru: Смотрите на дорогу, а мы смотрим на вас. Внимательность — залог безопасности!

# fatigueRecDescGood
source: Take deep breaths and ensure proper ventilation. Fresh air can help you stay alert!
ro: Respiră adânc și asigură o bună ventilație. Aerul proaspăt te poate ajuta să rămâi vigilent!
ru: Сделайте глубокий вдох и обеспечьте вентиляцию. Свежий воздух поможет оставаться бодрым!

# fatigueRecDescModerate
source: Your reaction time is slowing. Take a short break and grab a strong coffee!
ro: Timpul tău de reacție încetinește. Fă o pauză scurtă și bea o cafea puternică!
ru: Ваша реакция замедляется. Сделайте короткий перерыв и выпейте крепкий кофе!

# fatigueRecDescHigh
source: Your alertness is low. Take a break now—coffee might help, but rest is key!
ro: Atenția ta este scăzută. Fă o pauză acum — cafeaua poate ajuta, dar odihna este cheia!
ru: Ваше внимание снижено. Немедленно сделайте перерыв — кофе может помочь, но отдых важнее!

# fatigueRecDescExtreme
source: Extreme fatigue detected! Stop driving immediately and rest before continuing.
ro: A fost detectată oboseală extremă! Oprește cât mai curând mașina și odihnește-te înainte de a continua.
ru: Обнаружена крайняя усталость! Срочно остановитесь и отдохните перед продолжением.

# mainTab
source: Main
ro: Principal
ru: Главная

# exitTab
source: Exit
ro: Ieșire
ru: Выход

# cameraTab
source: Preview
ro: Camera
ru: Камера

# homeTab
source: Home
ro: Acasă
ru: Домой

# reportsTab
source: Reports
ro: Rapoarte
ru: Отчёты

# enableInSettingsTab
source: Enable in Settings
ro: Activează din setări
ru: Включить в настройках

# settingsTab
source: Settings
ro: Setări
ru: Настройки
